In [4]:
import mysql.connector
#importing database
database = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database="python 3pm"
)
db = database.cursor()

In [5]:
db.execute("SELECT * FROM student")
result =db.fetchall()
for x in result:
    print(x)

(1, 'Rama', 89, 98, 85, 67, 89, 420, 82.5, 'A')
(3, 'Nabin', 82, 84, 85, 98, 89, 430, 88.5, 'A')
(4, 'Shiva', 49, 57, 25, 98, 89, 400, 70.0, 'A')
(8, 'Ram', 78, 79, 93, 67, 78, 415, 83.5, 'A')
(10, 'Sameer', 89, 67, 80, 98, 89, 412, 82.5, 'A')
(11, 'Rama', 89, 45, 65, 87, 78, 364, 72.8, 'B')
(12, 'Ram', 87, 90, 65, 78, 87, 407, 81.4, 'A')
(13, 'Gauri', 98, 78, 90, 87, 78, 431, 86.2, 'A')
(15, 'Hari', 78, 67, 89, 98, 56, 415, 85.0, 'B')
(17, 'Hari', 78, 67, 89, 98, 56, 415, 85.0, 'B')
(40, 'Hari', 89, 89, 89, 78, 87, 412, 83.0, 'A')

In [6]:
db.execute("SELECT sn,name,total,grade FROM student")
result =db.fetchall()
for x in result:
    print(x)

(1, 'Rama', 420, 'A')
(3, 'Nabin', 430, 'A')
(4, 'Shiva', 400, 'A')
(8, 'Ram', 415, 'A')
(10, 'Sameer', 412, 'A')
(11, 'Rama', 364, 'B')
(12, 'Ram', 407, 'A')
(13, 'Gauri', 431, 'A')
(15, 'Hari', 415, 'B')
(17, 'Hari', 415, 'B')
(40, 'Hari', 412, 'A')

In [7]:
db.execute("SELECT * FROM student WHERE grade='A' ")
result =db.fetchall()
for x in result:
    print(x)

(1, 'Rama', 89, 98, 85, 67, 89, 420, 82.5, 'A')
(3, 'Nabin', 82, 84, 85, 98, 89, 430, 88.5, 'A')
(4, 'Shiva', 49, 57, 25, 98, 89, 400, 70.0, 'A')
(8, 'Ram', 78, 79, 93, 67, 78, 415, 83.5, 'A')
(10, 'Sameer', 89, 67, 80, 98, 89, 412, 82.5, 'A')
(12, 'Ram', 87, 90, 65, 78, 87, 407, 81.4, 'A')
(13, 'Gauri', 98, 78, 90, 87, 78, 431, 86.2, 'A')
(40, 'Hari', 89, 89, 89, 78, 87, 412, 83.0, 'A')

In [10]:
#insert
sql='''INSERT INTO `student` (`sn`, `name`, `physics`, `chemistry`, `math`, `english`, `nepali`, `total`, `per`, `grade`) 
VALUES ('18', 'Hari', '78', '67', '89', '98', '56', '415', '85', 'B');'''
db.execute(sql)
database.commit()

In [20]:
name = input("Enter name: ")
sn = int(input("Enter sn: "))
physics = int(input("Enter physics marks: "))
chemistry = int(input("Enter chemistry marks: "))
math = int(input("Enter math marks: "))
english = int(input("Enter english marks: "))
nepali = int(input("Enter nepali marks: "))

total = physics + chemistry + math + english + nepali
per = total / 5

if per >= 80: 
    grade = "A"
elif per >= 60 :
    grade = "B"
elif per >= 45:
    grade = "C"
else:
    grade = "F"
    
# Assuming you've initialized `db` as your database connection and `database` as your cursor
sql = f'''INSERT INTO `student` (`sn`, `name`, `physics`, `chemistry`, `math`, `english`, `nepali`, `total`, `per`, `grade`) 
         VALUES ('{sn}', '{name}', '{physics}', '{chemistry}', '{math}', '{english}', '{nepali}', '{total}', '{per}', '{grade}');'''
         
db.execute(sql)
database.commit()

Enter name: subheksha
Enter sn: 100
Enter physics marks: 100
Enter chemistry marks: 100
Enter math marks: 100
Enter english marks: 100
Enter nepali marks: 100

In [25]:
#update
sql="UPDATE student SET chemistry = 87,physics=90 WHERE sn=1"
db.execute(sql)
database.commit()

In [23]:
#update
subject=input("enter subject=")
marks=int(input("enter marks="))
sn=int(input("enter sn="))

sql=f"UPDATE student SET {subject} ={marks} WHERE student.sn={sn}"
db.execute(sql)
database.commit()

enter subject=physics
enter marks=100
enter sn=1

In [24]:
print(sql)

UPDATE student SET physics =100 WHERE student.sn=1

In [30]:
#delete
sql="DELETE FROM student WHERE sn = 100"
db.execute(sql)
database.commit()